testCases/otherCases/masterCase/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  x0
  {
    type            noSlip;
  }
  x1
  {
    type            noSlip;
  }

  z0
  {
      type            noSlip;
  }

  z1
  {
      type            noSlip;
  }

  y1
  {
      type            zeroGradient;
  }

  y0
  {
      type            noSlip;
  }

}



// ************************************************************************* //
